[
    {
        "image": "https://i.ibb.co/jhBvtX9/homescreenify-s-A3wym-Yqya-I-unsplash.jpg",
        "name": "Classic Spaghetti Carbonara",
        "details":"A traditional Italian pasta dish made with eggs, cheese, pancetta, and pepper. This dish is known for its creamy texture without the use of cream. Here's how to make it: \n\nIngredients:\n- 200g spaghetti\n- 100g pancetta or guanciale\n- 2 large eggs\n- 50g Pecorino Romano cheese, grated\n- 50g Parmesan cheese, grated\n- Freshly ground black pepper\n- Salt\n- 2 cloves garlic, peeled (optional)\n\nInstructions:\n1. Cook the spaghetti in a large pot of boiling salted water until al dente.\n2. In a bowl, beat the eggs and mix in the grated cheeses and a generous amount of black pepper.\n3. In a pan, cook the pancetta over medium heat until crispy. Optionally, add garlic cloves for flavor and then remove them.\n4. Drain the pasta, reserving some cooking water. Add the pasta to the pan with pancetta and toss to coat.\n5. Remove the pan from heat and quickly mix in the egg and cheese mixture, adding reserved pasta water as needed to create a creamy sauce.\n6. Serve immediately with extra grated cheese and black pepper.",
        "video": "https://example.com/videos/spaghetti_carbonara.mp4",
        "country": "Italy",
        "category": "Pasta",
        "email": "chef.italiano@example.com",
        "watchCount": 1524,
        "purchased_by": ["user1@example.com", "user2@example.com"]
    },
    {
        "image": "https://i.ibb.co/XsVyc3T/ikhsan-baihaqi-pbc2w-Xb-QYp-I-unsplash.jpg",
        "name": "Chinese Fried Rice",
        "details": "A savory and flavorful rice dish stir-fried with vegetables, eggs, and your choice of meat or tofu. Perfect for using leftover rice. Here's how to make it: \n\nIngredients:\n- 3 cups cooked and cooled rice\n- 2 tbsp vegetable oil\n- 1 onion, diced\n- 2 cloves garlic, minced\n- 1 cup mixed vegetables (peas, carrots, corn)\n- 2 eggs, beaten\n- 100g cooked meat or tofu, diced\n- 3 tbsp soy sauce\n- 1 tbsp oyster sauce (optional)\n- 1 tsp sesame oil\n- Salt and pepper to taste\n- Sliced green onions for garnish\n\nInstructions:\n1. Heat 1 tbsp oil in a large skillet or wok over medium-high heat. Add the beaten eggs and scramble until cooked. Remove and set aside.\n2. Add the remaining oil to the skillet and sauté the onion and garlic until fragrant.\n3. Add the mixed vegetables and cook for a few minutes until tender.\n4. Stir in the rice and cook until heated through, breaking up any clumps.\n5. Add the cooked eggs and meat or tofu, and stir to combine.\n6. Pour in the soy sauce, oyster sauce, and sesame oil. Toss everything together until well-coated.\n7. Season with salt and pepper to taste and garnish with green onions.",
        "video": "https://example.com/videos/fried_rice.mp4",
        "country": "China",
        "category": "Rice",
        "email": "chef.friedrice@example.com",
        "watchCount": 2043,
        "purchased_by": ["user37@example.com", "user38@example.com"]
    },
    {
        "image": "hhttps://i.ibb.co/DMGKDPT/kalyani-akella-gml9g1k-RQc-M-unsplash.jpg",
        "name": "Sushi Rolls",
        "details": "Delicious sushi rolls with fresh fish, vegetables, and seasoned rice, wrapped in seaweed. Here's a basic recipe for making sushi rolls: \n\nIngredients:\n- 2 cups sushi rice\n- 2 1/2 cups water\n- 1/2 cup rice vinegar\n- 2 tbsp sugar\n- 1 tbsp salt\n- Nori seaweed sheets\n- Fresh fish (salmon, tuna) or cooked crabmeat\n- Cucumber, julienned\n- Avocado, sliced\n- Soy sauce, for dipping\n- Pickled ginger and wasabi, for serving\n\nInstructions:\n1. Rinse the sushi rice under cold water until the water runs clear. Combine the rice and water in a rice cooker and cook according to the manufacturer's instructions.\n2. In a small saucepan, heat the rice vinegar, sugar, and salt until dissolved. Allow to cool.\n3. Once the rice is cooked, transfer it to a large bowl and gently fold in the vinegar mixture. Let the rice cool to room temperature.\n4. Place a sheet of nori on a bamboo sushi mat. Spread a thin layer of rice over the nori, leaving a small border at the top.\n5. Arrange the fish, cucumber, and avocado along the bottom edge of the rice.\n6. Using the bamboo mat, roll the sushi tightly from the bottom up. Moisten the top border with water to seal the roll.\n7. Slice the roll into bite-sized pieces and serve with soy sauce, pickled ginger, and wasabi.",
        "video": "https://example.com/videos/sushi_rolls.mp4",
        "country": "Japan",
        "category": "Seafood",
        "email": "chef.japan@example.com",
        "watchCount": 1987,
        "purchased_by": ["user5@example.com", "user6@example.com"]
    },
    {
        "image": "https://i.ibb.co/3CTLdPs/lucas-andrade-3-Uj0-Gw-Vm-Oe-Y-unsplash.jpg",
        "name": "Butter Chicken",
        "details": "A rich and creamy Indian curry made with tender chicken pieces in a spiced tomato sauce. Here's how to make it: \n\nIngredients:\n- 1 kg chicken thighs or breasts, cut into pieces\n- 1 cup plain yogurt\n- 2 tbsp lemon juice\n- 2 tsp turmeric\n- 2 tsp garam masala\n- 2 tsp ground cumin\n- 2 tbsp butter\n- 1 large onion, finely chopped\n- 3 cloves garlic, minced\n- 1 tbsp grated ginger\n- 1 tsp chili powder\n- 400g can crushed tomatoes\n- 1 cup heavy cream\n- Fresh cilantro for garnish\n- Salt to taste\n\nInstructions:\n1. Marinate the chicken with yogurt, lemon juice, turmeric, garam masala, and cumin for at least 1 hour.\n2. Heat butter in a large pan over medium heat.",
        "video": "https://example.com/videos/butter_chicken.mp4",
        "country": "India",
        "category": "Chicken",
        "email": "chef.india@example.com",
        "watchCount": 2154,
        "purchased_by": ["user11@example.com", "user12@example.com"]
    },
    {
        "image": "https://i.ibb.co/hCLXmYn/tempura.png",
        "name": "Japanese Tempura",
        "details": "Lightly battered and deep-fried seafood and vegetables, served with a dipping sauce. Tempura is a classic Japanese dish known for its crispy texture and delicate flavors. Here's how to make it: \n\nIngredients:\n- Assorted seafood (shrimp, fish) and vegetables (sweet potato, bell pepper, zucchini)\n- 1 cup all-purpose flour\n- 1 cup ice-cold water\n- 1 egg\n- Vegetable oil for frying\n- Tempura dipping sauce:\n  - 1/2 cup dashi\n  - 1/4 cup soy sauce\n  - 1/4 cup mirin\n  - Grated daikon radish (optional)\n\nInstructions:\n1. Prepare the seafood and vegetables by cleaning and cutting them into bite-sized pieces.\n2. In a mixing bowl, combine the flour, ice-cold water, and egg. Mix until just combined (it's okay if the batter is a little lumpy).\n3. Heat the vegetable oil in a deep fryer or large pot to 350°F (180°C).\n4. Dip the seafood and vegetables into the batter, shaking off any excess, then carefully place them into the hot oil.\n5. Fry the tempura in batches until golden brown and crispy, about 2-3 minutes per batch.\n6. Remove the tempura from the oil and place them on a paper towel-lined plate to drain any excess oil.\n7. Serve the tempura hot with the dipping sauce on the side.",
        "video": "https://example.com/videos/tempura.mp4",
        "country": "Japan",
        "category": "Fried",
        "email": "chef.tempura@example.com",
        "watchCount": 1654,
        "purchased_by": ["user27@example.com", "user28@example.com"]
    },
    {
        "image": "https://i.ibb.co/HhLHNJh/chiken-biriyani.jpg",
        "name": "Chicken Biryani",
        "details": "Chicken Biryani is a classic Indian dish made with aromatic basmati rice, tender marinated chicken, and a blend of spices. This flavorful one-pot meal is perfect for special occasions or weeknight dinners. Here's how to make it: \n\nIngredients:\n- 2 cups basmati rice\n- 500g chicken, cut into pieces\n- 1/2 cup yogurt\n- 2 onions, thinly sliced\n- 2 tomatoes, finely chopped\n- 2 tbsp ginger-garlic paste\n- 1/4 cup chopped mint leaves\n- 1/4 cup chopped coriander leaves\n- Whole spices (cinnamon, cardamom, cloves)\n- Ghee or oil\n- Salt to taste\n\nInstructions:\n1. Rinse the basmati rice under cold water until the water runs clear. Soak the rice in water for 30 minutes, then drain and set aside.\n2. In a large bowl, marinate the chicken pieces with yogurt, ginger-garlic paste, chopped mint leaves, chopped coriander leaves, and salt. Let it marinate for at least 1 hour.\n3. In a large pot, heat ghee or oil over medium heat. Add the sliced onions and cook until golden brown and caramelized. Remove half of the onions and set aside for garnishing.\n4. To the remaining onions in the pot, add the chopped tomatoes and cook until they turn soft and pulpy.\n5. Add the marinated chicken to the pot and cook until it is partially cooked.\n6. Layer the soaked and drained rice over the partially cooked chicken in the pot. Sprinkle the whole spices over the rice.\n7. Pour enough water into the pot so that it covers the rice by about 1 inch. Bring the water to a boil, then reduce the heat to low, cover the pot with a tight-fitting lid, and let the biryani simmer for 20-25 minutes, or until the rice is cooked through and the chicken is tender.\n8. Once the biryani is cooked, remove it from the heat and let it rest, covered, for 5-10 minutes.\n9. Garnish the biryani with the reserved caramelized onions and serve hot with raita or your favorite chutney.",
        "video": "https://example.com/videos/chicken_biryani.mp4",
        "country": "India",
        "category": "Rice",
        "email": "chef.biryani@example.com",
        "watchCount": 2345,
        "purchased_by": ["user33@example.com", "user34@example.com"]
    },
    {
        "image": "https://i.ibb.co/3CTLdPs/lucas-andrade-3-Uj0-Gw-Vm-Oe-Y-unsplash.jpg",
        "name": "Crispy Chicken Fry",
        "details": "Juicy pieces of chicken marinated in spices and fried to a golden crisp. Crispy Chicken Fry is a popular dish that's easy to make and incredibly delicious. Here's how to make it:\n\nIngredients:\n- 500g chicken pieces\n- 1 cup buttermilk\n- 1 cup all-purpose flour\n- 1 tsp paprika\n- 1 tsp garlic powder\n- Salt and pepper to taste\n- Oil for frying\n\nInstructions:\n1. Place the chicken pieces in a bowl and pour the buttermilk over them. Make sure the chicken is fully submerged in the buttermilk. Cover the bowl and refrigerate for at least 1 hour, or overnight for best results.\n2. In a separate bowl, combine the all-purpose flour, paprika, garlic powder, salt, and pepper. Mix well to combine.\n3. Remove the marinated chicken from the refrigerator and let it sit at room temperature for 10-15 minutes.\n4. Heat oil in a large skillet or deep fryer to 350°F (180°C).\n5. Dredge each piece of chicken in the seasoned flour mixture, shaking off any excess.\n6. Carefully place the coated chicken pieces in the hot oil, making sure not to overcrowd the skillet or fryer.\n7. Fry the chicken pieces for 5-6 minutes on each side, or until they are golden brown and crispy and the internal temperature reaches 165°F (75°C).\n8. Once the chicken is cooked through and crispy, remove it from the oil and place it on a wire rack or paper towel-lined plate to drain any excess oil.\n9. Serve the crispy chicken fry hot with your favorite dipping sauce or accompaniments.",
        "video": "https://example.com/videos/chicken_fry.mp4",
        "country": "USA",
        "category": "Fried",
        "email": "chef.chickenfry@example.com",
        "watchCount": 2398,
        "purchased_by": ["user39@example.com", "user40@example.com"]
    },
    {
        "image": "https://i.ibb.co/p2cBpfT/daily-slowdown-7-TOCB28rms-unsplash.jpg",
        "name": "Beef Curry",
        "details": "A hearty and spicy beef curry made with tender beef chunks, tomatoes, and a blend of aromatic spices. Beef Curry is a comforting dish that's perfect for a cozy dinner. Here's how to make it:\n\nIngredients:\n- 1 kg beef, cut into cubes\n- 2 onions, finely chopped\n- 3 tomatoes, chopped\n- 3 cloves garlic, minced\n- 1-inch piece of ginger, grated\n- 2 green chilies, slit lengthwise\n- 1/4 cup yogurt\n- 2 tbsp vegetable oil\n- 1 tbsp garam masala\n- 1 tbsp ground coriander\n- 1 tsp ground turmeric\n- 1 tsp red chili powder\n- 1/2 tsp ground cumin\n- Salt to taste\n- Fresh cilantro leaves for garnish\n\nInstructions:\n1. Heat the vegetable oil in a large pot or Dutch oven over medium heat. Add the chopped onions and sauté until they turn golden brown.\n2. Add the minced garlic, grated ginger, and slit green chilies to the pot, and sauté for a minute until fragrant.\n3. Add the chopped tomatoes to the pot and cook until they turn soft and pulpy.\n4. Add the beef cubes to the pot and cook until they are browned on all sides.\n5. Stir in the garam masala, ground coriander, ground turmeric, red chili powder, ground cumin, and salt. Cook for a few minutes until the spices are fragrant.\n6. Add enough water to the pot to cover the beef cubes. Bring the curry to a boil, then reduce the heat to low, cover the pot, and let it simmer for 1.5-2 hours, or until the beef is tender.\n7. Once the beef is cooked through and the curry has thickened, remove the pot from the heat.\n8. Garnish the beef curry with fresh cilantro leaves and serve hot with steamed rice or your favorite bread.\n",
        "video": "https://example.com/videos/beef_curry.mp4",
        "country": "India",
        "category": "Curry",
        "email": "chef.beefcurry@example.com",
        "watchCount": 1876,
        "purchased_by": ["user35@example.com", "user36@example.com"]
    },
    {
        "image": "https://i.ibb.co/n8QXkvF/ivan-torres-MQUqbmsz-GGM-unsplash.jpg",
        "name": "Margherita Pizza",
        "details": "A simple yet delicious pizza topped with fresh tomatoes, mozzarella cheese, and basil leaves. Margherita Pizza is a classic Italian dish that's perfect for a cozy night in. Here's how to make it:\n\nIngredients:\n- Pizza dough\n- 1/2 cup pizza sauce\n- 1 cup shredded mozzarella cheese\n- 2-3 ripe tomatoes, thinly sliced\n- Fresh basil leaves\n- Olive oil\n- Salt and pepper to taste\n\nInstructions:\n1. Preheat your oven to the highest temperature setting, usually around 500°F (260°C).\n2. Roll out the pizza dough on a floured surface to your desired thickness.\n3. Transfer the rolled-out dough to a pizza pan or baking sheet.\n4. Spread the pizza sauce evenly over the dough, leaving a small border around the edges.\n5. Sprinkle the shredded mozzarella cheese over the sauce.\n6. Arrange the tomato slices on top of the cheese.\n7. Drizzle olive oil over the pizza and season with salt and pepper to taste.\n8. Bake the pizza in the preheated oven for 10-12 minutes, or until the crust is golden brown and the cheese is bubbly and melted.\n9. Remove the pizza from the oven and let it cool for a few minutes.\n10. Garnish the pizza with fresh basil leaves before slicing and serving hot.\n",
        "video": "https://example.com/videos/margherita_pizza.mp4",
        "country": "Italy",
        "category": "Pizza",
        "email": "chef.pizza@example.com",
        "watchCount": 1897,
        "purchased_by": ["user25@example.com", "user26@example.com"]
    },
    {
        "image": "https://i.ibb.co/QJTvXb0/tiramisu.jpg",
        "name": "Classic Tiramisu",
        "details": "A traditional Italian dessert made with layers of coffee-soaked ladyfingers, mascarpone cheese, and cocoa. Tiramisu is a decadent dessert that's perfect for any special occasion. Here's how to make it:\n\nIngredients:\n- 6 large egg yolks\n- 3/4 cup granulated sugar\n- 1 cup mascarpone cheese\n- 1 1/2 cups heavy cream\n- 2 cups brewed espresso or strong coffee, cooled\n- 1/4 cup coffee liqueur (optional)\n- 1 package ladyfingers\n- Unsweetened cocoa powder for dusting\n- Dark chocolate shavings for garnish (optional)\n\nInstructions:\n1. In a large bowl, whisk together the egg yolks and granulated sugar until the mixture is thick and pale.\n2. Add the mascarpone cheese to the egg yolk mixture and whisk until smooth and well combined.\n3. In a separate bowl, whip the heavy cream until stiff peaks form.\n4. Gently fold the whipped cream into the mascarpone mixture until fully incorporated. Set aside.\n5. In a shallow dish, combine the cooled espresso or coffee with the coffee liqueur (if using).\n6. Quickly dip each ladyfinger into the coffee mixture, ensuring they are moistened but not soggy.\n7. Arrange a layer of the dipped ladyfingers in the bottom of a 9x13-inch dish or a similar-sized serving dish.\n8. Spread half of the mascarpone mixture over the layer of ladyfingers, smoothing it out with a spatula.\n9. Repeat the process with another layer of dipped ladyfingers, followed by the remaining mascarpone mixture.\n10. Cover the dish and refrigerate for at least 4 hours, or overnight, to allow the flavors to meld and the tiramisu to set.\n11. Before serving, dust the top of the tiramisu with unsweetened cocoa powder and garnish with dark chocolate shavings, if desired.\n12. Serve chilled and enjoy this classic Italian dessert.",
        "video": "https://example.com/videos/tiramisu.mp4",
        "country": "Italy",
        "category": "Dessert",
        "email": "chef.dessert@example.com",
        "watchCount": 1724,
        "purchased_by": ["user21@example.com", "user22@example.com"]
    }

]
